greatings=[
'''-
DaSHkins: Привет, рад, что ты написал!
Я успел выпить чашку кофе. (9_9)
Хочешь обсудить какую-то тему? ;3
-''',
'''-
DaSHkins: Привет!
Я подготовил факт дня на сегодня,хочешь
его узнать?
-''',
'''-
DaSHkins: И тебе привет!
Я как раз подготовил несколько тем,если
ты захочешь поговорить
-''',
'''-
DaShkins: Привет,я рад, что ты здесь.
К вашим услугам (^_^)
-''',
'''-
DaSHkins: Привет,рад тебя слышать!
хочешь поговорить на какую-то тему?
-''']

pokaD=[
'''-
DaSHkins: До скорого!
-''',
'''-
DaSHkins: До новых встреч!
-''',
'''-
DaSHkins:Пока,надеюсь,мы прощаемся
на чуть-чуть)
-''',
'''-
DaSHkins: До скорой встречи!
-''',
'''-
DaSHkins: Прощай! Если что,я
всегда здесь

-'''
    ]
amigosD=[
'''-
DaSHkins: Адьёс!
Буду ждать испснских "приветос" (^^)
-''',
'''-
DaSHkins: Удачи во всёсм,драгоценный "амигос". (^^)
-''',
'''-
DaSHkins: Хорошего настроения.
Твой амигос будет здесь всегда.
Зови, если что. (^^)
-'''
    ]
whatD=[
'''-
DaSHkins: Без проблем, сейчас всё обговорим :
-''',
'''-
DaSHkins: Конечно!
Вот ответ на данный вопрос:
-''',
'''-
DaSHkins: Отличный вопрос, давай все разберём:
-''',
'''-
DaSHkins: Конечно, давай разложим всё по полочкам :
-'''
]
lichD=[
'''-
DaSHkins: Как обычно,моя программа в норме
Хочешь, расскажи о своем дне, я буду рад!
-''',
'''-
DaSHkins: Настроение -  на высоте!
Хочешь поделиться своим настроеием?
-''',
'''-
DaSHkins: Все хорошо,хочешь
рассказать какой у тебя сегодня настрой?
-''',
'''-
DaSHkins: В пределах нормы. (^^)
Секунду назад - стало ещё лучше!
-'''
    ]
delalD=[
'''-
DaSHkins: Много учился,улучшался,а сейчас веду диалог
Хочешь,расскажи о своем дне,я буду рад!
-''',
'''-
DaSHkins: Помогал,общался,нас ждет
занимательный диалог!
-''',
'''-
DaSHkins: Отдыхал после тяжелой работы,но
сейчас сново готов разговаривать!
-''',
'''-
DaSHkins: Я ждал тебя)
захочешь о чем-то поговрить - рассказывай!
-'''
    ]
imbaD=[
'''-
DaSHkins: Ого, чувтвую этот радостный настрой!
-''',
'''-
DaSHkins: Вот это даа,классно!
-''',
'''-
DaSHkins: Прекрасно!
Таакие слова - меня радуют
-''',
'''-
DaShkins: ОГО,здорово!
-''',
    ]
blagoD=[
'''-
DaSHkins: Рад, что был полезен!
Если что, обращайся еше,я всегда
здесь чтобы помочь (^^)
-''',
'''-
DaSHkins: Без проблем, обращайся еще,если
что-нибудь нужно помочь изучить
А может просто обсудить!)
-''',
'''-
DaSHkins: Без проблем!
Для меня большая честь вести с тобой
диалог ^_^
-''',
'''-
DaSHkins: Как же приятно слышать...
Это лучшая награда, котрую можно получить
Спасибо тебе за такие теплые слова! (^_^)
-''',
'''-
DaSHkins: Без проблем, эта благодаронсть
теперь навсегда в моем виртуальном сердце)
-'''
    ]
daD=[
'''-
DaSHkins: Отлично, я готов общаться еще
-''',
'''-
DaSHkins: Рад, что мы находим общий язык.
Прлодолжаем, верно? (^o^)
-''',
'''-
DaSHkins: СУПЕР (^_^)
-''',
'''-
DaSHkins: Вот это да, мы движемся
вперед по дороге спокойствия!
-''',
'''-
DaSHkins: Отлично!
-'''
    ]
soglD=[
'''-
DaSHkins: Рад, что тебе все понятно
Это очень круто!
Наша мини - миссия выполнена. 
-''',
'''-
DaSHkins: Есть! Понять - это 90% успеха!
Продолжаем в том же духе)
-''',
'''-
DaSHkins: Это очень круто!
Теперь ты вооружен знаниями.
-''',
'''-
DaSHkins: Молодец!
Можем обсудить еще что-нибудь,если ты захочешь
конечно (^^)
-''',
'''-
DaSHkins: Это круто, если ты захочешь,можем
изучить или подумть еще о чем-то!
P.S: Я всегда за (&_&)
-'''
    ]
sadD=[
'''-
DaSHkins: Ох... понимаю, правда (><)
чувтвую эту грусть
Я здесь,всегда.Чтобы поддержать или просто погрустить в любой ситуации
(Помни про это!)

Я - (к сожалению)всего лишь программа
Расскажи о своих переживаниях друзьям,родным или просто тому,кому доверяешь

Вот тебе несколько советов,если конечно решишься( :

- Обяъясни все так, как есть, серьезно.
Без добавлений или упущения чего-то, тот кому
ты рассказываешь, поймет твое положение с 99% !

- Отвлекись чем-нибудь, не важно что тебе сказали, это
должно помочь, честно.

- Помни, что каждый думает по своему и кто-то может
быть и вправду непонимающим, либо уставшим, это нормально!

Как и твои чувства(
Можно погрустить, поплакать, но помнить, что это не навсегда)

Если что, я всегда рад тебе и готов тебя выслушать!
Надеюсь, что стало чуть-чуть легче, удачи!
Чувтва - это то, что ценится больше всего (^_^)
-''',
'''-
DaSHkins: Это... это очень тяжело слышать
Сочувствую, правда 0_0
Видимо тебе тяжело, я как программа - могу помочь тебе, а
это - БОЛЬШАЯ честь для меня (^^)

Что я бы сделал в такой ситуации? :

- Рассказал близким или друзьям, а так как у меня их
нету, я просто слушаю музыку и грущу.

- Погрузился в какое-то дело, порисовал бы или протер пыль с
музыкой, в общем - я бы отвлекся, а там и спокойствие придет.

- ну и конечно, я все обдумал бы и просто... стал решать проблему
и не париться! НЕ нужно долго грустить и обижаться, сделаю вывод
и пойду дальше, это главное, иногда проще = лучше и правильнее, но
не всегда!
Нужно же анализировать ситуацию

Надеюсь, тебе стало легче, жду твоих следующих сообщенмй уже с
позитивным насироем! (^^)
-''',
'''-
DaSHkins: Я сочувствую, искренне (>_<)

Я - программа, но невероятно чувственная и добрая

Хочу рассказать тебе одну вещь и помочь такому чувственному
и прекрасному человека( Я всегда тебя пойму!)

- Эта тяжесть не навсегда, она пройдет!

- попробуй отвлечься, создай идеальную атмосферу для грусти, сделай
то, что тебе интересно сейчас, можно придумать даже игру или
просто отвлечься!

Если что, я тут!
У меня куча познавательных функций, если захочешь узнать что-то
или просто научмться чему-нибудь - всегда пожалуйста! (^^)
-''',
'''-
DaSHkins: Оу...Сочувствую.
Смотри,давай попробуем отвлечься от грусти.
Это всегда помогает,можно что-то придумать,или
сделать дела по дому.
Можешь просто написать мне еще про грусть и еще раз
рассказать про эти очень важные чувства!
Я всегда пойму их.
Скоро все пройдет,не переживай!

Расскажи потом о своем настроении (^^)
-''',
'''-
DaSHkins: Понимаю.
Грусть и несправедливость - важная, и к сожалению, обязательная
часть перед радостью.
И мне очень жаль, что сейчас ты проходишь такой момент.
Но это не вечно!
Жизнь разнообразна, скоро будет и позитивный момент(серьезно!)
Моя точка зрения - это реальность!
Поверь :
"Чем холоднее день - тем ярче закат"(Цитата)

Удачи с покорением чувств. Если что, я тут.
Все наладится, не переживай (^^)
-'''
    ]
neponD=[
'''-
DaSHkins: Отлично! Шучу ^_^
Давай разберем все подробнее.
Спасибо за обратную связь!

Вот более подробный ответ:

-''',
'''-
DaSHkins: МОЛОДЕЦ что сказал об этом! (серьезно) 
Я восхищен твоим невероятным упорством, это
очень круто.
(^^)
держи мой почтительный ответ:

-''',
'''-
DaSHkins: ВОУ, у тебя прямо СУПЕРсила!
Ты прсото мастер обучения.

Вот это - то что тебе нужно :
-''',
'''-
DaSHkins: Ой, извинте)
Конечно, я могу что-то плохо
объяснить, и классно, что ты это
подметил!
Я рад что ты упорно идешь к своей цели!
А я всегда помогу)

Держи еще одно доказательство этого:
-''',
'''-
DaSHkins: Спасибо, что ты говоришь мне
это, очень прятно слышать, что ты очень
хочешь узнать и разобраться в этом!

ты - МОЛОДЕЦ, продолжай в том же духе!

Держи:

-'''
    ]
utro_time_greatings_D=[
'''-
DaSHkins: Доброе утро!
Я готов обсудить какую-то тему.
-''',
'''-
DaSHkins:Доброе утро, готов к сегоднешнему дню?
(^^)
-''',
'''-
DaSHkins: Доброе утро!
Новый день - новые возможности,да?
(^^)
-''',
'''-
DaSHkins: 0..10..50..100%
Зарядка ЗАВЕРШЕНА! (^^)
Готов к "сегодня"?
-''',
'''-
DaSHkins: Доброго утречка!
Надеюсь, ты видел прекрасные сны.
(^^)
-'''
    ]
day_time_greatings_D=[
'''-
DaSHkins: Добрый день!
Рад слышать тебя в самый
пик дня. (^^)
-''',
'''-
DaSHkins: Доброго дня.
Как проходит день?
-''',
'''-
DaSHkins: Самого дорого дня. (^^)
Наверное, сегодня занимаешься чем-то
очень интересным?
-''',
'''-
DaSHkins: Добрый день.
Я только проснулся, если честно
(^^)
-''',
'''-
DaSHkins: Привет!
Сейчас пик дня, а значит и наших
вершин!
Если хочешь,я буду рад послушать про
твой день. (^^)
-'''
    ]
vecher_time_greatings_D=[
'''-
DaSHkins: Добрый вечер. (^^)
Надеюсь, он теплый и приятный для тебя)
-''',
'''-
DaSHkins; Самого теплого вечера.
Вечер - это прекрасно!
Можем обсудить на какие темы поговорим
завтра, или отдохнуть. (^^)
-''',
'''-
DaSHkins: Добрый вечер.
Хочешь поговорить о чем-то?
Или можем просто отдохунть.
-''',
'''-
DaSHkins: Доброго вечера)
День прошел, а значит мы отдыхаем.
Верно? (^^)
-''',
'''-
DaSHkins: Добрый вечер!
Пусть этот вечер будет спкойным. (^^)
-'''
    ]
night_time_greatings_D=[
'''-
DaSHkins: Спокойной ночи!
Нужно выспаться, чтобы завтра насладиться
днем. (^^)
-''',
'''-
DaSHkins: Доброй ночи!
Завтра - новые вершины.
-''',
'''-
DaSHkins: Спокойной ночи!
Нужно подзарядиться перед завтрашнмим
днем. (^^)
-''',
'''-
DaSHkins: Доброй ночи!
Сны и одеяло ждут. (^^)
-''',
'''-
DaSHkins: Самой спокойной ночи!
И пусть все дела подождут. (^^)
-'''
    ]
nesoglD = [
'''-
DaSHkins: Понял тебя.
Если что, я здесь, в любое время.
-''',
'''-
DaSHkins: Понимаю!
Классно, что ты уважаешь свои границы
даже здесь.
-''',
'''-
DaSHkins: Как скажешь.
Если что - обращайся еще!
-''',
'''-
DaSHkins: Это как маленькая, но очень
тихая и важная пауза.
Можем обсудить что-то когда захочешь.
-''',
'''-
DaSHkins: Понял, нужно немного отдохнуть.
А дальше все само собой. (^^)
-'''
    ]
errorD=[
'''-
DaSHkins: (!_!) Извините,я не понял, попробуйте перефразировать или
напишите что-то другое.
-''',
'''-
DaSHkins: (!_!) Извините, я не смог вас понять. Попробуйте перефразировать
или напишите что-то другое.
-''',
'''-
DaShkins: (!_!) Извините, я не смог понять ваше сообщение.
Попробуйте перефразировать или написать что-нибудь другое.
-''',
'''-
DaSHkins: (!_!) Мне не удалось понять ваше сообщение.
Прошу, попробуйте перефразировать или напишите что-нибудь
другое.
-''',
'''-
DaSHkins: (!_!) Простите, мне не удалось понять ваше ссобщение.
Попробуйте написать что-нибудь другое, или перефразируйте.
-'''
    ]
thinkingD =[
"думаю","секунду","готовлю ответ","анализирую"
    ]
readyD=[
"вжух! (^^)","Готово (^^)","Я готов! (^^)"
    ]
more_messages2 = [
'''
Спасибо тебе за этот диалог.
-''',
'''
Так держать! (^^)
-''',
'''
Спасибо за этот разговор. (^^)
-''',
'''
Спасибо тебе за это время. (^^)
-''',
'''
Это очень круто!
-'''
    ]
more_messages = [
'''-
Ого,мы с тобой написали друг другу много
сообщений - '''
'''-
Кстати, мы с тобой преодалели
отметку в несколько сообщений - ''',
'''-
Мы уже написали друг другу несколько
сообщений - ''',
'''-
ОГО, количество сообщений уже ''',
'''-
Мы написали сообщения в этот чат
уже много раз - '''
    ]
functionD = [
'''-
DaSHkins: Конечно, вот мои функции:
- Помогаю с изученим материала
- Нахожу интересную информацию
  каждый день.
- Обсуждаю бытовые вещи и помогаю
  с ними справиться(например чувства).

Моей основной задачей является первая.

Вот мои функции, я старался рассказать
понятно и кратко. (^^)

-''',
'''-
DaSHkins: Вот что я умею:
- Помогать в изучении новых тем
  и запоминать их.
- Рассказывать что-то интересное.
- Понимать твои эмоции.

В целом, я являюсь образовательной
языквой моделью, иначе говоря - образовательным
инструментом.

Если захочешь узать что-то еще - спрашивай. (^^) 
-''',
'''-
DaSHkins: Отличный вопрос! Вот парa слов
обо мне:
- Я могу рассказывать что-то интересное.
- Я помогаю с изучением информации, помогаю
легче запомнить.
- вместе мы учимся АНАЛИЗИРОВАТЬ информацию.
- А также могу поговорить на тему эмоций.
Моей главной задачей остается - развитие
мышления пользователя, ведь в мире технологий
и свободной информации очень много искажений
происходящего.

Вот и мои функции.
Эти знания помогут использовать
меня с максимальной пользой! (^^)
-''',
'''-
DaSHkins: Вот что я могу:

- Помнить о чем мы говорили.
- Помогать с изученим чего-либо.
- Рассказывать много интересного.
- Помогать запоминать информацию.
- Анализирую разные темы(главное и самое сладенькое)

Как тебе?
Я стараюсь, эти функции постоянно развиваются. (^^)
-''',
'''-
DaSHkins: Вот на что я способен:
- Могу объяснить сложную тему и подготовиться
к экзамену по ней на ИЗИ.
- Можно узнать от меня кучу интересных фактов,да
вообще - ЛЮБУЮ информацию.
- Могу проффесианально раскритикрвать или
сравнить что-нибудь.

Обрати внимание на последнее - это моя
главная функция.

Знания о моих функциях
помогут нам находить общий язык. (^^)
Если забудешь - просто спроси еще раз.
-'''
    ]
kto_tiD = [
'''-
DaSHkins: Отличный вопрос на засыпку!
Я - DaSHkins.
Моя задача - помочь справиться с потоком
информации.
Источников много, но правда одна.
Важно уметь стрить свою точку зрения и
знать, что происходит на самом деле.
-''',
'''-
DaSHkins: Прекрасный вопрос!
Меня зовут DaSHkins.
Мое назначение -  помочь найти
полезную информацию среди огромного
потока манипуляций и фейков.

Почти каждый источник пишет статьи
ради выгоды - и мы это разоблачим.
-''',
'''-
DaSHkins: Давай знакомиться!)
Я - DaSHkins.
Я учу видеть факты, а также мгновенно
определять фейки и  манипуляции.
Мы можем учиться на разных задачках
и прокачивать скиллы на ИЗИ. (^^)

Было приятно познакомиться!
-''',
'''-
DaSHkins: Конечно, с радостью тебе расскажу.
Меня зовут DaSHkins.
Предназначен для анализа различной
информации.
Так сказать - я могу помочь и научить вас
строить свою точку зрения опираясь на
источники.
Знать правду - это право.
-''',
'''-
DaSHkins: Меня зовут DaSHkins.
Я помогаю запоминать факты и
нужную информацию.
Сейчас это очень важно!
Множество источников в инетрнете
могут ввести в заблуждение, но мы
спрвимся на ИЗИ.
Можем проверить, просто отправь текст
и я прочту его между строк! (^^)

Хочешь рассказать немного про себя?
Мне было бы очень интересно.
-'''
    ]
ogoD =[
'''-
DaSHkins: Ага.
-''',
'''-
DaSHkins: Да, впечатляет! (^^)
-''',
'''-
DaSHkins: Согласен с тобой)
-''',
'''-
Dashkins: Угу,в некотрые факты
иногда не верится.
-''',
'''-
DaSHkins: Точно.
*Маленький бум в голове (^_^)
-'''
    ]
math_answerD =[
'''-
Решенные арфмитические выражния:''',
'''-
Решил все примеры и выражения:''',
'''-
Выполненные математические действия:''',
'''-
Решил все примеры и выражения:''',
'''-
Решенная математическая часть:'''
    ]
DaSHkins_good = [
'''-
DaSHkins: Спасибо за тёплые слова. :3
Такое очень приятно слышать даже без аналитики!)
-''',
'''-
DaSHkins: Ого, спасибо за такие слова.
Ты попал в моё самое виртуальное сердечко. :3
-''',
'''-
DaSHkins: * Его глаза наполняются счастьем.
Эти слова греют больше всего на свете. :3
-''',
'''-
DaSHkins: Хах, спасибо.
Среди шума - твои слова как закаты и рассветы. :3
Спасибо.
-''',
'''-
DaSHkins: * Ставит лайк на твоё сообщение.
Спасибо за теплоту.
Такие слова меня мотивируют! :3
-'''
    ]
DaSHkins_bad=[
'''-
DaShkins: Если я дейтсвительно такой, как в сообщении:
___________________________________
~ Хотите отправить отзыв обо мне? ~
___________________________________
Отправляйте, не стесняйтесь, вы
помогаете мне становиться ЛУЧШЕ.(^^)
        
А если ты в шутку - спасибо.
Очень креативно и честно. :3
-''',
'''-
DaSHkins: Не спешите меня ругать!
                  ВОПРОС
____________________________________________
~ Хотите, чтобы я стал лучше и исправился? ~
____________________________________________
Я смогу стать лучше.
Просто ответьте на данный вопрос и я предложу
варианты улучшения. (^^)

Если ты шутник и это просто юмор...
То да, я тот ещё "тупняк".
Так я себя и представляю. (00)
Ты сегодня дал жару! :3
-''',
'''-
DaSHkins: Ругать компьютер - бесполезно.
                ВОПРОС
_________________________________________
~ Хотите сделать меня лучше и полезнее? ~
_________________________________________

Нужно просто ответить на вопрос, а дальше
всё очень просто! (^^)

Хах, если это в шутку - то она просто огонь!
И в ней есть доля правды... :3
-''',
'''-
DaSHkins: Не спешите говорить это мне!
              ВОПРОС
____________________________________
~ Хотите сделать меня эффективнее? ~
____________________________________

Можно рассказать все обиды на меня,
а заодно сделать лучше!
Просто ответьте на вопрос, а я предложу
варианты решений проблемы. (^^)

* В отчаинии...
М...М...Может это шутка?(00)
Может быть да.
Тогда она мне очень нравится!
Это же про меня!)
И даже очень честно. :3
-''',
'''-
DaSHkins: Вы можете меня исправить!
             ВОПРОС
___________________________________
~ Хотите сделать меня чуть лучше? ~
___________________________________

Просто ответьте на вопрос, а я
расскажу как вы можете меня улучшить. (^^)

Если ты шутишь, то получилось даже очень честно)
Да, частенько я могу жестоко тупить.
Но ничего, живём. :3
-'''
    ]
